#include <iostream>
#include <conio.h>


using namespace std;

int max(long int x)
{
	// x>>31 зсуваємо біт знаку в молодший біт , відповідно , якщо число відємне , то всі біти будуть рівні 1
	// інакше всі біти бутунь рівні 0
	// ~(x>>31) - дійснюєм інверсію , якщо число додатнє то всі біти будуть рівні 1 інакше 0
	// (~(x>>31))&x- накладаємо отриману маску на задане число в результаті якщо число відємне то результатом
	// буде 0 , бо в цьому випадку усі біти маски рівні (0) інакше маска рівна -1 (тобто всі одиниці )
	// результатом буде вхідне число , що символізуватиме , що воно додатнє
	
	return (~(x>>31))&x;
}


int main ()
{
	long int x, i=(long int)0;
	while(i<3)
	{
		cout<<"\nEnter digit  : ";
		cin>>x;
		
		if(max(x)||x==0)
			cout<<"Digit "<<x<<" is positiv\n";
		else
			cout<<"Digit "<<x<<" is negative\n";
	
		i++;
	}
	getch();

}